terraform {
  required_providers {
    azurerm = {
      source = "hashicorp/azurerm"
      version = "4.32.0"
    }
  }
}

provider "azurerm" {
  features {}
  subscription_id = "1075ec7a-b17a-4f37-bf3f-9d68c4506dc1"
}

# 🌱 कहानी: "छोटा बीज"

# Ek chhote se gaon me ek kisaan rehta tha. Uske paas ek purana sa khet tha jisme mitti bhi utni acchi nahi thi. Ek din usne bazaar se ek chhota sa बीज खरीदा. Beej dekhne me bilkul aam sa tha, chhota aur halka. Gaon ke log hansne lage –
# “इतने छोटे बीज से क्या होगा?!”

# Par kisaan ne हिम्मत नहीं हारी. Usne beej ko प्यार से मिट्टी में बोया, रोज पानी दिया, धूप में रखा, और तूफ़ान आने पर भी ढक कर बचा लिया.

# दिन, हफ्ते, और महीने गुज़रे…
# धीरे-धीरे उस छोटे बीज से एक हरी कोंपल निकली. कुछ ही सालों में वही बीज एक मजबूत पेड़ बन गया, जिसकी छांव तले पूरा गाँव बैठकर आराम करने लगा.

# लोग हैरान थे. वही छोटा बीज, जिसे सबने हल्का समझा था, आज सबकी ज़िंदगी का सहारा बन गया.

# 👉 सीख:
# कभी भी अपने आप को छोटा मत समझो. थोड़ा धैर्य, मेहनत और विश्वास हो तो सबसे छोटा बीज भी बड़ा पेड़ बन सकता है. 🌳